todos/app/controllers/api/todos_controller.rb

INSERT INTO "todos" ("title", "body", "done") VALUES ($1, $2, $3) RETURNING "id"  [["title", "new todo"], ["body", "ajax request"], ["done", false]]
---
    def create
        @todo = Todo.new(todo_params)
        if @todo.save

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "todos" SET "done" = $1 WHERE "todos"."id" = $2  [["done", true], ["id", 2]]
---
    def update
        @todo = Todo.find(params[:id])

        if @todo.update(todo_params)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 1]]
---
    def destroy
        @todo = Todo.find_by(id: params[:id])
        @todo.destroy